# Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) 

# n = int(input('Введите трехзначное число: '))
# print(n)
# sum = 0
# while n > 0:
#     i = n % 10
#     sum = sum + i
#     n = n//10

# print(sum)


n = int(input('Введите трехзначное число: '))

a = n // 100
b = n // 10 % 10
c = n % 10
sum = a + b + c

print(n, '-> ', sum, '(', a, b, c, ')')